app/controllers/paintings_controller.rb

SELECT "paintings".* FROM "paintings"
---
  def index
    @paintings = Painting.all

SELECT "paintings".* FROM "paintings" WHERE "paintings"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @painting = Painting.find(params[:id])

INSERT INTO "paintings" ("created_at", "gallery_id", "image", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Tue, 22 Jan 2013 08:12:58 UTC +00:00], ["gallery_id", 1], ["image", "desktop.png"], ["name", "dfe"], ["updated_at", Tue, 22 Jan 2013 08:12:58 UTC +00:00]]
---
  def create
    @painting = Painting.new(params[:painting])
    if @painting.save

SELECT "paintings".* FROM "paintings" WHERE "paintings"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @painting = Painting.find(params[:id])

SELECT "paintings".* FROM "paintings" WHERE "paintings"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "paintings" SET "image" = 'vlcsnap-2013-01-21-22h28m41s95.png', "updated_at" = '2013-01-22 09:09:23.387344' WHERE "paintings"."id" = 1
---
  def update
    @painting = Painting.find(params[:id])
    if @painting.update_attributes(params[:painting])